In [9]:
## Import Packages
import pandas as pd
import mysql.connector
import os
from sqlalchemy import create_engine

# Use sqlalchemy to connect to my MySQL Database
engine = create_engine('mysql+mysqlconnector://root:****@localhost/paradise_tables')
orders = pd.read_sql('SELECT * FROM orders', engine)
orders.head()

   OrderID  Revenue       Date  CustomerName  DeliveryFee
0        1    350.0 2022-07-09      Ngo Tran            0
1        2     65.0 2022-08-15   Angela Tang            0
2        3     69.0 2022-08-19  Elezar Perez            0
3        4     93.0 2022-08-27   Jennifer Le            0
4        5      0.0 2022-09-01  Theresa Tran            0

# Question 1: Total Revenue
Let's start with a simple question: How much revenue has Paradise Tables generated in total ever since I started it as a side business last summer?

In [11]:
query_1 = '''
            SELECT SUM(Revenue) AS total_rev
            FROM `paradise_tables`.`orders`
'''
pd.read_sql(query_1, engine)

     total_rev
0  9324.799992

# Question 2: Total Orders
Now that I know how much revenue I've earned, I want to know how many orders I've received from customers. I have to filter my dataset to orders where I made money (Revenue > 0) because there are orders I've done for free for birthdays, marketing events, etc.

In [12]:
query_2 = '''
            SELECT COUNT(*) AS total_orders
            FROM `paradise_tables`.`orders`
            WHERE Revenue > 0
'''
pd.read_sql(query_2, engine)

   total_orders
0            43

In [7]:
query_3 = '''
            SELECT date_format(date, "%Y-%m") AS date,
                SUM(`Revenue`) AS total_rev
            FROM `paradise_tables`.`orders` 
            GROUP BY MONTH(`Date`)
'''
pd.read_sql(query_3,engine)

      date    total_rev
0  2022-07   350.000000
1  2022-08   227.000000
2  2022-09   979.399994
3  2022-10   714.599991
4  2022-11  1147.400009
5  2022-12  1805.699982
6  2023-01   990.800003
7  2023-02   725.900013
8  2023-03   889.000000
9  2023-04  1495.000000

In [5]:
query_4 = '''
            SELECT COUNT(*) / COUNT(DISTINCT date_format(date, "%Y-%m")) AS avg_orders_per_month 
            FROM `paradise_tables`.`orders` 
            WHERE Revenue > 0
'''
pd.read_sql(query_4,engine)

   avg_orders_per_month
0                   4.3

In [6]:
query_5 = '''SELECT SUM(Quantity) AS tot_quant, 
                ItemID, 
                ItemDescription 
            FROM `paradise_tables`.`order_details` AS od 
            JOIN `paradise_tables`.`orders` AS o 
            ON od.OrderID = o.OrderID 
            WHERE Revenue > 0 
            GROUP BY ItemID 
            ORDER BY tot_quant DESC'''
pd.read_sql(query_5 ,engine)

    tot_quant ItemID                 ItemDescription
0       466.0    110         Assorted Fruit Pastries
1       308.0     30           Mango Cheesecake Cups
2       229.0    150         Nutella Cheesecake Cups
3       203.0     10          Matcha Cheesecake Cups
4       198.0     20      Strawberry Cheesecake Cups
5       193.0     60             Banana Pudding Cups
6       183.0     50           Tres Leches Cake Cups
7       170.0    210  Chocolate Covered Strawberries
8       120.0    170       Earl Grey Cheesecake Cups
9       119.0    120              Cheesecake Cookies
10      107.0    160   Cookie Butter Cheesecake Cups
11       98.0     40       Blueberry Cheesecake Cups
12       91.0    100               Mango Mousse Cups
13       77.0     90          Strawberry Mousse Cups
14       71.0     80           Chocolate Mousse Cups
15       24.0    240          Chocolate Chip Cookies
16       24.0    250                   Sugar Cookies
17       20.0    260              Jello Custard Cups
18       12.0    180   Pumpkin Spice Cheesecake Cups
19        8.0    200               Deluxe Fruit Tray
20        3.0    140                Grand Fruit Tray
21        1.0    500          Small Catering Package

In [7]:
query_6 = '''
        SELECT AVG(TotalQuantity)
            FROM (
                SELECT SUM(Quantity) AS TotalQuantity, 
                    od.OrderID
                FROM `paradise_tables`.`order_details` AS od
                JOIN `paradise_tables`.`orders` AS o
                ON o.OrderID = od.OrderID
                WHERE Revenue > 0
                GROUP BY OrderID) AS a
'''
pd.read_sql(query_6, engine)

   AVG(TotalQuantity)
0             63.3721

In [8]:
query_7 = '''
            SELECT o.Date, 
                    o.OrderID, 
                    o.Revenue, 
                    sub.supply_cost, 
                    ingredients.ingredient_cost, 
                    labor.compensation,
                    sub.supply_cost + ingredients.ingredient_cost AS total_cost,
                    o.Revenue - (sub.supply_cost + ingredients.ingredient_cost) AS profit
                FROM `paradise_tables`.`orders` AS o
                JOIN (
                    SELECT SUM(Quantity * avg_supply_price) AS supply_cost, 
                            s.OrderID,
                            s.SupplyID, 
                            s.SupplyDescription
                        FROM `paradise_tables`.`supplies_used` AS s
                        LEFT JOIN(SELECT AVG(Cost/Quantity) AS avg_supply_price, SupplyID, SupplyDescription 
                        FROM `paradise_tables`.`overhead` 
                        GROUP BY SupplyID) AS a
                        ON s.SupplyID = a.SupplyID  
                        GROUP BY s.OrderID) AS sub
                ON o.OrderID = sub.OrderID
                JOIN (
                    SELECT SUM(Cost) AS ingredient_cost, 
                        OrderID
                    FROM `paradise_tables`.`ingredients` AS i
                    GROUP BY i.OrderID) AS ingredients
                ON o.OrderID = ingredients.OrderID 
                LEFT JOIN (
                    SELECT SUM(Compensation) AS compensation, 
                    l.OrderID
                    FROM `paradise_tables`.`labor` AS l
                    GROUP BY l.OrderID
                ) AS labor
                ON o.OrderID = labor.OrderID'''
pd.read_sql(query_7,engine)

,Date,OrderID,Revenue,supply_cost,ingredient_cost,compensation,total_cost,profit
0,2022-10-01,10,135.0,4.740200,36.660000,NaN,41.400200,93.599800
1,2022-10-02,13,0.0,3.855250,61.999999,NaN,65.855249,-65.855249
2,2022-10-08,11,236.2,24.735500,26.159999,NaN,50.895500,185.304497
3,2022-10-08,12,120.0,15.027400,12.470000,NaN,27.497400,92.502600
4,2022-10-22,16,0.0,44.060001,88.759998,NaN,132.819999,-132.819999
5,2022-11-11,17,120.0,15.853525,70.670000,NaN,86.523525,33.476475
6,2022-11-12,19,64.8,6.871500,7.450000,NaN,14.321500,50.478503
7,2022-11-12,18,62.4,8.615200,29.030000,NaN,37.645200,24.754802
8,2022-11-13,20,264.0,20.352000,17.420000,NaN,37.772000,226.228000
9,2022-11-19,21,62.4,8.615200,4.990000,NaN,13.605200,48.794802
10,2022-11-26,22,196.8,24.101900,55.900000,NaN,80.001900,116.798103
11,2022-11-27,23,377.0,40.703500,61.199999,NaN,101.903499,275.096501
12,2022-11-24,24,0.0,8.214200,10.490000,NaN,18.704200,-18.704200
13,2022-12-03,25,360.0,24.450000,120.740001,NaN,145.190001,214.809999
14,2022-12-13,26,182.0,22.541100,24.040000,20.000000,46.581100,135.418900
15,2022-12-18,27,316.0,23.531400,100.240000,31.000000,123.771400,192.228600
16,2022-12-18,28,105.0,9.775000,6.560000,NaN,16.335000,88.665000
17,2022-12-18,29,0.0,3.304500,10.230000,NaN,13.534500,-13.534500
18,2022-12-23,30,274.3,20.386100,63.779999,NaN,84.166100,190.133888
19,2022-12-24,31,100.8,13.035100,8.980000,NaN,22.015100,78.784903
20,2022-12-24,32,163.2,15.228500,17.980000,NaN,33.208500,129.991497
21,2022-12-25,34,36.0,1.560800,14.960000,NaN,16.520800,19.479200
22,2022-12-25,33,165.2,16.972200,11.680000,NaN,28.652200,136.547797
23,2022-08-15,2,65.0,2.319600,18.660000,NaN,20.979600,44.020400
24,2022-08-19,3,69.0,6.136825,9.040000,NaN,15.176825,53.823175
25,2022-08-27,4,93.0,13.925900,20.150000,NaN,34.075900,58.924100
26,2022-09-01,5,0.0,4.956750,16.860001,NaN,21.816751,-21.816751
27,2022-09-03,6,70.0,6.871500,5.480000,NaN,12.351500,57.648500
28,2022-09-24,7,118.0,5.344800,65.059998,33.340000,70.404798,47.595202
29,2022-09-24,8,560.0,71.124601,65.059998,33.330002,136.184599,423.815401
30,2022-09-24,9,231.4,9.357200,65.059998,33.330002,74.417198,156.982796
31,2022-10-08,14,42.0,6.136825,0.000000,NaN,6.136825,35.863175
32,2022-10-15,15,181.4,15.486700,0.000000,171.000000,15.486700,165.913294
33,2022-12-31,35,103.2,10.176000,7.570000,NaN,17.746000,85.453997
34,2023-01-07,36,64.8,9.711900,10.490000,NaN,20.201900,44.598103
35,2023-01-21,37,445.0,19.439258,97.269998,50.000000,116.709257,328.290743
36,2023-01-21,38,197.0,16.019500,3.870000,NaN,19.889500,177.110500
37,2023-01-27,39,284.0,34.047667,34.829999,NaN,68.877667,215.122333
38,2023-02-05,40,108.0,1.159800,15.970000,NaN,17.129800,90.870200
39,2023-02-25,41,596.2,36.016000,139.970000,NaN,175.986001,420.214012
40,2023-02-25,42,21.7,3.105867,30.249999,NaN,33.355866,-11.655865
41,2023-03-04,43,685.0,13.490833,95.949999,NaN,109.440832,575.559168
42,2023-03-20,44,72.0,9.999900,33.039999,NaN,43.039899,28.960101
43,2023-03-25,45,132.0,13.667700,21.630000,NaN,35.297700,96.702300
44,2023-04-01,46,520.0,65.732218,56.309999,NaN,122.042216,397.957784
45,2023-04-08,47,545.0,11.015000,87.609998,90.000000,98.624999,446.375001
46,2023-04-16,48,430.0,11.015000,69.819999,NaN,80.834999,349.165001

In [9]:
query_8 = '''
            SELECT SUM(Hours) AS hours, 
                LaborID, 
                LaborDescription
            FROM `paradise_tables`.`personal_labor`
            GROUP BY LaborID   
'''
pd.read_sql(query_8,engine)

     hours LaborID    LaborDescription
0   20.430     100  Buying Ingredients
1  150.330     200     Making Desserts
2    6.866     300            Delivery
3    4.000     400              Set Up

In [10]:
query_9 = '''
            SELECT AVG(Cost) as avg_cost, 
                SUM(Quantity) as qty,
                COUNT(*) as cnt, 
                IngredientDescription, 
                Location
            FROM `paradise_tables`.`ingredients` 
            GROUP BY Location, IngredientID
            HAVING count(*) > 5
            ORDER BY cnt DESC, qty ASC
'''
pd.read_sql(query_9,engine)

    avg_cost   qty  cnt    IngredientDescription                  Location
0  14.111250  22.0   16              Heavy Cream             Smart & Final
1  34.489090  11.0   11  No Ingredients Recorded                       nan
2   4.691000  11.0   10              Blueberries             Smart & Final
3  23.657777  21.0    9             Cream Cheese                    Costco
4   2.227500   8.0    8      2% Reduced Fat Milk             Smart & Final
5   1.404286   7.0    7          Evaporated Milk             Smart & Final
6   3.935714  16.0    7                  Mangoes  Good Fortune Supermarket
7  11.265714  18.0    7             Strawberries             Smart & Final
8   8.191667  16.0    6             Strawberries                      Aldi

In [11]:
query_10 ='''
            WITH temp_table AS (
                SELECT SUM(Revenue) AS total_rev,
                    CustomerName
                FROM `paradise_tables`.`orders`
                GROUP BY CustomerName
                HAVING total_rev > 300)
            SELECT t.CustomerName, t.total_rev, sub.num_orders, sub.num_items, sub.total_qty
            FROM temp_table as t
            JOIN (
                SELECT CustomerName, 
                    COUNT(DISTINCT o.OrderID) AS num_orders, 
                    COUNT(DISTINCT od.ItemID) AS num_items, 
                    SUM(Quantity) AS total_qty
                FROM `paradise_tables`.`orders` AS o 
                JOIN `paradise_tables`.`order_details` AS od
                ON o.OrderID = od.OrderID
                GROUP BY CustomerName
                HAVING count(DISTINCT od.ItemID) > 5 ) AS sub
            ON t.CustomerName = sub.CustomerName
            ORDER BY sub.num_orders DESC, total_rev DESC


'''
pd.read_sql(query_10,engine)

         CustomerName   total_rev  num_orders  num_items  total_qty
0         Shelley Gao  613.700001           3          9      237.0
1       Shereen Aclan  418.199997           2          9      132.0
2           Ella Diep  685.000000           1          7      182.0
3  Michelle Alvarenga  596.200012           1          9      216.0
4        Shannen Vong  545.000000           1          6      101.0
5         Sandy Cakes  430.000000           1          6      101.0
6         Andrea Wong  377.000000           1          6      101.0
7              Denice  360.000000           1          6      101.0
8            Tam Tran  316.000000           1          6       73.0